package com.example.azkarapp.data

import com.example.azkarapp.R
import com.example.azkarapp.model.ItemType

class Datasource() {
  fun loadType() : List<ItemType>{
      return listOf<ItemType>(ItemType(R.string.morning_azkar,R.drawable.morning),
          ItemType(R.string.evening_azkar,R.drawable.evening),
          ItemType(R.string.sleep_azkar,R.drawable.images)
      )
  }

   fun loadAzkarElsabah() : List<String>{
     return listOf("اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت وإليك النشور",
         "اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت"
      ,"اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر",
         "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
         "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
         "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم  إني أعوذ بك من الكفر، والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت",
         "رضيت بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبيا",
         "أصبحنا وأصبح الملك لله رب العالمين، اللهم إني أسألك خير هذا اليوم:فتحه، ونصره، ونوره، وبركته، وهداه، وأعوذ بك من شر ما فيه وشر ما بعده"
          ,"يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين" )
   }
    fun loadAzkarElmasaa() : List<String>{
        return listOf("اللهم بك أمسينا، وبك أصبحنا، وبك نحيا، وبك نموت وإليك النشور",
            "اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت"
            ,"اللهم ما أمسي بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر",
            "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
            "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
            "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم  إني أعوذ بك من الكفر، والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت",
            "رضيت بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبيا",
            "أمسينا وأمسي الملك لله رب العالمين، اللهم إني أسألك خير هذا اليوم:فتحه، ونصره، ونوره، وبركته، وهداه، وأعوذ بك من شر ما فيه وشر ما بعده"
            ,"يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين" )
    }
}